[
  {
    "date": "2026-02-14",
    "version": "v1.1.0",
    "type": "feature",
    "title": "",
    "description": "",
    "features": [
      "BINGO page added! plan and track the hunts you wanna do throughout the year and share your progress with friends.",
      "Added a button on public profile views to also view the persons BINGO sheet if there is any data set."
    ],
    "fixes": [
      "Added a back button to the public profile dex and bingo pages so you dont get stuck on the page.",
      "Added the ability to hover over game icons on the BINGO page on PC to view the games full name."
    ]
  },
  {
    "date": "2026-02-09",
    "version": "v1.0.8",
    "type": "feature",
    "title": "",
    "description": "",
    "features": [
      "Added a 'Related Forms' section to the Pokemon sidebar that shows all variant forms (GMAX, Alpha, Gender, Regional, etc.) for the selected Pokemon.",
      "Evolution chains in the sidebar now display Alpha forms when an Alpha Pokemon is selected.",
      "Added tooltips to the 'Obtainable In' game icons in the sidebar to display full game names on hover.",
      "Added sorting by oldest and newest accounts to the trainers page."
    ],
    "fixes": [
      "Fixed an issue where manually adjusting a counter's value would delete the entire hunt.",
      "Improved styling in the Hunt Settings modal for encounter count and increment adjustments.",
      "Resolved inconsistencies where the Shiny Charm modifier was not applied when starting a new hunt.",
      "Fixed female hippopotas ID being 450 instead of 459, (Anyone who had data on this pokemon will need to re-add it (sorry!)).",
      "Fixed alpha unova lilligant ID since I am a idiot and wrote it incorrectly.",
      "Fixed some forms not showing when searching with the 'Show Evolutions' toggle on.",
      "Fixed an issue where shiny locks were not correctly displayed on Pokémon that should have been locked.",
      "Fixed a aligment issue with the quick links in the footer on mobile devices.",
      "Fixed an issue where guest users were unable to navigate back to the home page after viewing a profile.",
      "Fixed an issue on mobile where the background remained scrollable while the sidebar was open.",
      "Fixed the hamburger menu overlapping the sidebar on mobile devices.",
      "Fixed an issue where page controls on the trainers page were stacked vertically instead of horizontally.",
      "Moved the page controls on the changelogs page to be above so they dont shift when changing pages.",
      "Simplified changelog pagination to display '1' instead of '1-1' when viewing a single update."
    ]
  },
  {
    "date": "2026-02-01",
    "version": "v1.0.7",
    "type": "feature",
    "title": "Search Improvements",
    "description": "",
    "features": [
      "Added the ability to multi-search across all categories. For example, you can now search for Pokémon with both the Mighty Mark and the Common Mark."
    ],
    "fixes": [
      "Improved the sites loading screen with added animations and better visuals.",
      "Removed the sparkle animation from the title on the public home page.",
      "Added a shimmer animation to the title on the public home page.",
      "Updated registration button icons to a pen and paper design for a more professional appearance.",
      "Resolved layout shifts caused by Pokémon displays on the landing page.",
      "Fixed a issue that would not allow users to open the Caught/Uncaught search dropdown.",
      "Fixed an issue where autofilling an email in the settings would cause the field to appear white instead of the site's theme color."
    ]
  },
  {
    "date": "2026-01-28",
    "version": "v1.0.6",
    "type": "fix",
    "title": "Scrollbar fixes, SEO improvements & Performance improvements",
    "description": "",
    "features": [
      "Added a search option for game obtainable in.",
      "Advanced the obtainable in data to also include version exclusives."
    ],
    "fixes": [
      "Switched to new backend server to help with performance and stability !!!BIG CHANGE HOPEFULLY DOESNT BREAK ANYTHING!!!.",
      "Cloudflare removed and hopefully logins/registers will be quicker now.",
      "Scrollbar now works correctly on all pages and devices.",
      "SEO improvements to help with Google AdSense verification & search engine results.",
      "Performance improvements to the website to help with lag on the main dex display.",
      "Tracking 2059 Pokemon on home page changed to Tracking 2064 Pokemon to be correct lol.",
      "Made the Made by Antonic text on the public home page clickable leading to my solo.to profile."
    ]
  },
  {
    "date": "2026-01-21",
    "version": "v1.0.5",
    "type": "feature",
    "title": "Mobile fixes & Dex Preferences expansion",
    "description": "",
    "features": [
      "Split up the options to block GO and NO OT exclusive shinies into two separate options.",
      "Added a option to completly hide all locked pokemon.",
      "Added new Dex Preferences to change the view mode of the dex to categorized or alphabetical."
    ],
    "fixes": [
      "Resolved a critical mobile bug where clicking a caught Pokémon slot in the main grid caused data loss.",
      "Fixed a issue on certain mobile devices where the sidebar would appear on all taps instead of holds.",
      "Fixed Alpha Male Sneasel in the Alpha Genders & Other's category having a wrong Id causing issues with the numbers. (Anyone who had data on this pokemon will need to re-add it (sorry!)).",
      "Bug fixes & compatibility improvements for iOS devices. (Needs Testing)",
      "Adjusted the trainer page buttons to change pages to be more in uniform and cleaner looking.",
      "Fixed a bug where people could not submit bug reports or feature requests.",
      "Fixed an issue where modal animations would break upon a fresh login."
    ]
  },
  {
    "date": "2026-01-19",
    "version": "v1.0.4",
    "type": "fix",
    "title": "Alpha Regional Forms added & Removed Kantonian Electrode",
    "description": "",
    "features": [
      "Alpha Alolan Raichu added.",
      "Galarian Alpha Slowpoke line added.",
      "Galarian Alpha Stunfisk added.",
      "Alpha Johto Qwilfish added.",
      "You can now update your account's email address from the settings page."
    ],
    "fixes": [
      "Alpha Kantonian Electrode removed from Alpha Genders & Other's category.",
      "Fixed scrollbar not appearing in certain situations.",
      "Unique IDs added to all Pokemon, Forms, and other data for future proofing, performance and stability.",
      "Fixed alignment of the search icon on the changelogs page.",
      "Fixed a bug where clicking Mark All with a locked pokemon would set the locked pokemon as caught.",
      "Accent color buttons in the settings page now display a checkmark to clearly show the selected color."
    ]
  },
  {
    "date": "2026-01-02",
    "version": "v1.0.3",
    "type": "feature",
    "title": "Legends Z-A Pokemon Added & Some Small Features/Fixes",
    "description": "",
    "features": [
      "All Legends Z-A and Mega Dimensions DLC Pokemon added and will now show under the obtainable games section along with all the alpha forms",
      "When searching for a Pokemon by name a new switch will appear allowing you to show that Pokemon's evolutions also in the search results",
      "Legends Z-A added with all methods and shiny odds when tracking a hunt",
      "Sidebar will now display how long the hunt took if you use the built-in counter on the website",
      "Sidebar will now automatically display the shiny odds and will ask for modifiers (shiny charm, sparkling power, etc.) when tracking a hunt",
      "Shiny Charm button added under the search that allows you to manage the games you have shiny charm so it auto sets the modifier when you add a pokemon or hunt",
      "Shiny Charm button seconds as a display to show off what games you have shiny charm on when viewing a profile",
      "2 NEW settings added to show a lock icon over shiny locked pokemon and/or Pokemon GO & NO OT exclusive shinies"
    ],
    "fixes": [
      "Changed wording for some tags in the sidebar such as Male now says Male Form and Female now says Female Form",
      "Alpha Others category now organized by dex number instead of Hisui dex order",
      "Sidebar icons replaced with actual SVG icons instead of basic emojis",
      "Many performance improvements and code cleanup"
    ]
  },
  {
    "date": "2025-11-24",
    "version": "v1.0.2",
    "type": "feature",
    "title": "Admin Badge, Profile Icon Cleanup & Some Other Fixes",
    "description": "",
    "features": [
      "Crown icon added to admin profile pages and trainers page",
      "Tooltips added to admin crown icon and sharable link icon",
      "Instagram & tiktok icons added to the footer"
    ],
    "fixes": [
      "Fixed loading screen visual issue where spinner and dots appeared merged together",
      "Hovering the likes button will no longer have a background color",
      "Likes button will now be colored red when viewing a profile not logged in",
      "Improved sanitization of input fields to prevent XSS attacks"
    ]
  },
  {
    "date": "2025-10-17",
    "version": "v1.0.1",
    "type": "feature",
    "title": "Legends Z-A Mobile Fixes Admin Panels & Many Other Fixes",
    "description": "",
    "features": [
      "Mobile header now uses a mobile hamburger menu instead of tabs",
      "Changelog page added (This page) here you can see updates like you are reading and also submit bug reports or feature requests below",
      "Admins and admin panel added (Only accessible to admins)",
      "Legends Z-A game added as a new game option when adding information to a pokemon (ZA Alpha Pokemon coming soon)",
      "Legends Z-A added as a game option with odds calculation when tracking a hunt"
    ],
    "fixes": [
      "Fixed profile dropdown visibility and scroll issue on mobile",
      "Fixed mobile layout issues related to the search bar on Changelog and Trainers pages"
    ],
    "changes": [
      "Enhanced mobile header sizing and profile picture",
      "Improved mobile dropdown styling",
      "Alpha not hisuian Arcanine and Zoroark removed from Alpha Genders & Other's category",
      "Alpha Forms is now sorted by national dex number instead of hisui dex order"
    ]
  }
]